//შექმენი სტრუქტურა Human, რომელსაც აქვს სახელი, გვარი, დაბადების თარიღი, აიდი ინტ ტიპის, ტელეფონის მოდელი, რომელიც შეიძლება ჰქონდეს შეიძლება არა, შუა სახელი რომელიც შეიძლება ქოინდეს შეიძლება არა.
//
//ჰყავს დედა და მამა.
//
//აქვს ფუნქცია რომელიც აბრუნებს დედის და მამის თაფლს.
//
//ფუნქცია რომელიც აბრუნებს ამ ადამიანის აღწერილობას სტრინგად.
//
//ფუნქცია რომელიც აბრუნებს რამდენ წელში გახდება ეს ადამიანი 50 წლის თუ უკვე არაა. თუ უკვე არის დააბრუნოს -1
struct Human {
    let name: String
    let surname: String
    var birthDate: Int
    let ID: Int
    let phone: String?
    let nickname: String?
    let mom: String
    let dad: String
    
}

func reMomDad(mom: String, dad: String) ->
func f(arg: Int) {
    
}
